Revit 2024 API
UIApplication.ActiveAddInId Property
 Get current active external application or external command id.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public AddInId ActiveAddInId { get; }
Visual Basic
Public ReadOnly Property ActiveAddInId As AddInId
	Get
Visual C++
public:
property AddInId^ ActiveAddInId {
	AddInId^ get ();
}
See Also
UIApplication Class
Autodesk.Revit.UI Namespace